{
  "backend/main.mo": "Motoko backend actor providing access control, content management, gallery items, enquiries, and user profiles with admin/user permission checks.",
  "feature_evidence.json": "Feature evidence report mapping implemented admin-auth features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Lists short summaries of key frontend admin-auth related files.",
  "frontend/index.css": "Tailwind CSS config with color variables and theming for light and dark modes.",
  "frontend/index.html": "HTML entry page mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up the React router, site layout, public pages, and protected admin route with theme provider.",
  "frontend/src/components/admin/AdminFloatingButton.tsx": "Floating button that opens the admin login modal.",
  "frontend/src/components/admin/AdminLoginModal.tsx": "Modal handling admin username/password login using useAdminAuth and redirecting on success.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Protects admin routes by checking session authentication and showing login UI if unauthenticated.",
  "frontend/src/components/admin/analytics/AnalyticsPanel.tsx": "Static placeholder analytics dashboard with cards for upcoming visitor and page view metrics.",
  "frontend/src/components/admin/contact/ContactDetailsManager.tsx": "Form UI for viewing and updating contact details using query hooks and save mutation.",
  "frontend/src/components/admin/content/ContentManager.tsx": "CRUD interface for content sections with dialogs for creating, editing, and deleting sections.",
  "frontend/src/components/admin/enquiries/EnquiriesManager.tsx": "Lists, reads, and deletes enquiries with a detail dialog and read-status handling.",
  "frontend/src/components/admin/gallery/GalleryManager.tsx": "Manages gallery items including upload, create, edit, and delete with progress tracking.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to enter and save their profile name.",
  "frontend/src/components/forms/EnquiryForm.tsx": "Public form for submitting enquiries, validating fields, and showing a success message.",
  "frontend/src/components/home/GalleryPreview.tsx": "Displays up to six active gallery items or fallback images and links to the full gallery.",
  "frontend/src/components/layout/Footer.tsx": "Renders footer with logo, quick links, contact details from API, and social media icons.",
  "frontend/src/components/layout/Header.tsx": "Shows site header with logo, desktop and mobile navigation, and active route highlighting.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the app with header, footer, page tracking, admin button, and profile setup modal.",
  "frontend/src/content/defaultContent.ts": "Defines default content sections for multiple site pages with titles, bodies, and publish flags.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to user identity and refreshes dependent queries.",
  "frontend/src/hooks/useAdminAuth.ts": "Handles admin login via session token with temporary credential check and logout logic.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session tokens in localStorage with expiration handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context using DFINITY AuthClient with login and identity management.",
  "frontend/src/hooks/usePageViewTracking.ts": "Hook that triggers a non-blocking page view tracking call whenever the route path or actor changes.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating content sections, gallery items, enquiries, and other backend data via an actor.",
  "frontend/src/hooks/useSiteContent.ts": "Provides helpers to fetch content sections with fallback to default content and exposes loading state and all sections.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, transitions, and accessibility focus styles.",
  "frontend/src/main.tsx": "Entry point that renders the app wrapped with React Query and Internet Identity providers.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page by displaying multiple content sections sourced via useSiteContent.",
  "frontend/src/pages/AcademicsPage.tsx": "Displays academic-related content sections using cards and updates the page title on mount.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Provides an admin dashboard with tabbed management for content, gallery, enquiries, contact details, and analytics, plus logout handling.",
  "frontend/src/pages/AdmissionsPage.tsx": "Shows admissions content, provides prospectus download, and includes an enquiry form.",
  "frontend/src/pages/ContactPage.tsx": "Renders contact information, optional map embed, and a contact enquiry form using data from useGetContactDetails.",
  "frontend/src/pages/GalleryPage.tsx": "Displays gallery items with category filtering using tabs and shows active images in a responsive grid.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with hero text, features, programs, testimonials, and a gallery preview using site content sections.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, colors, animations, and plugins like typography and container queries.",
  "project_state.json": "Project metadata describing site requirements, architecture notes, known issues, and implemented features for the school website."
}