{
  "backend/main.mo": "Motoko canister defining content, gallery, enquiries, profiles, and admin session logic with access control and storage mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented admin-auth and error-handling features with related files and test IDs.",
  "frontend-file-summaries.txt": "Text file mapping frontend source paths to short functional summaries for each component or hook.",
  "frontend/index.css": "Tailwind-based global stylesheet defining light/dark theme CSS variables and base styles.",
  "frontend/index.html": "HTML entry point providing root mount element and loading the main React script.",
  "frontend/src/App.tsx": "Main application router setup with page routes, admin-guarded route, and theme provider.",
  "frontend/src/components/admin/AdminFloatingButton.tsx": "Floating action button that opens the admin login modal.",
  "frontend/src/components/admin/AdminLoginModal.tsx": "Modal for admin username/password login with sanitized error handling and redirects on success.",
  "frontend/src/components/admin/AdminRouteGuard.tsx": "Route guard that handles admin auth validation, errors, and login prompts before rendering protected content.",
  "frontend/src/components/admin/analytics/AnalyticsPanel.tsx": "Displays placeholder analytics cards and a dashboard section indicating future analytics features.",
  "frontend/src/components/admin/contact/ContactDetailsManager.tsx": "Provides a form to view and update contact details with save handling and validation.",
  "frontend/src/components/admin/content/ContentManager.tsx": "Manages content sections with create, edit, delete, search, and merged default/backend section logic.",
  "frontend/src/components/admin/enquiries/EnquiriesManager.tsx": "Lists enquiries with read, delete, and detail view functionality, sorted by submission date.",
  "frontend/src/components/admin/gallery/GalleryManager.tsx": "Allows creating, editing, and deleting gallery items with image uploads and category selection.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal prompting new authenticated users to enter and save their name for profile setup.",
  "frontend/src/components/forms/EnquiryForm.tsx": "Form component for submitting enquiries, handling validation, API submission, and success UI state.",
  "frontend/src/components/home/GalleryPreview.tsx": "Displays up to six active gallery items with fallback images and a link to the full gallery.",
  "frontend/src/components/layout/Footer.tsx": "Renders site footer with logo, quick links, contact details, and social media icons.",
  "frontend/src/components/layout/Header.tsx": "Responsive site header with navigation links, mobile menu, and active route highlighting.",
  "frontend/src/components/layout/SiteLayout.tsx": "Wraps the site with header, footer, tracking, admin button, and profile setup modal.",
  "frontend/src/content/defaultContent.ts": "Defines default content sections for various pages, including home and about text blocks.",
  "frontend/src/hooks/adminSessionStore.ts": "Session store managing admin auth token with sessionStorage persistence and listener updates.",
  "frontend/src/hooks/useActor.ts": "Hook creating and refreshing backend actor instances based on identity and admin token.",
  "frontend/src/hooks/useAdminAuth.ts": "Combines admin session and actor state to expose admin authentication status and actions.",
  "frontend/src/hooks/useAdminSession.ts": "Manages admin session tokens with validation, error handling, and sync via a shared store.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context with login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/usePageViewTracking.ts": "Tracks page views reactively and sends analytics events via the backend actor.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend CRUD operations in React Query hooks for content sections, gallery items, and related data.",
  "frontend/src/hooks/useSiteContent.ts": "Fetches published content sections and falls back to default content when missing.",
  "frontend/src/index.css": "Defines Tailwind-based theme variables, dark mode colors, transitions, and global styles.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/pages/AboutPage.tsx": "Displays multiple about‑related content sections using site content hooks.",
  "frontend/src/pages/AcademicsPage.tsx": "Renders academic information sections pulled dynamically from site content.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Provides an admin dashboard with tabbed management tools for content, gallery, enquiries, and contact details, plus logout handling.",
  "frontend/src/pages/AdmissionsPage.tsx": "Renders the admissions page with dynamic content sections, a prospectus download button, and an admission enquiry form.",
  "frontend/src/pages/ContactPage.tsx": "Displays contact details, an optional embedded map, and a contact enquiry form using fetched backend data.",
  "frontend/src/pages/GalleryPage.tsx": "Shows a filterable gallery of active images by category with tab navigation and preview cards.",
  "frontend/src/pages/HomePage.tsx": "Builds the homepage with dynamic hero content, feature highlights, program summaries, testimonials, and a gallery preview.",
  "frontend/src/utils/errorMessage.ts": "Converts unknown or technical error messages into safe, user‑friendly English strings with specific rule-based mappings.",
  "frontend/src/utils/siteNavigation.ts": "Defines the site's navigation links and includes a helper to remove duplicate link entries.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear them from the URL or storage.",
  "frontend/tailwind.config.js": "Tailwind configuration defining dark mode, content paths, extended color tokens, animations, and enabled plugins.",
  "project_state.json": "Describes the project’s current state, known issues, and feature requests focused on fixing admin login and session validation logic."
}