{
  "kind": "build_request",
  "title": "Fix inability to access the admin panel (admin login/session + route guard)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Make admin login reliably grant access to the /admin dashboard after successful credentials entry, including when the user is not logged in with Internet Identity (anonymous actor). Ensure the system does not get stuck on “Verifying admin access…” and that /admin renders the login prompt when unauthenticated.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "I am not able to access the admin panel"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /admin as a fresh visitor shows the Authentication Required screen (not an infinite loading state).",
        "Clicking Login opens the Admin Panel Login modal and allows a successful login flow that results in the admin dashboard being rendered.",
        "After a successful login, reloading the page at /admin keeps the admin dashboard accessible for the same browser session until logout (or until the session is invalidated).",
        "If the backend actor is temporarily unavailable, the UI shows a clear English error state (not a blank page/spinner) and still allows retrying login."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Fix backend admin session/auth logic so that adminLogin does not fail due to authorization/role-assignment constraints and validateAdminSession accurately reflects the logged-in admin session. Session validation must work for the same caller principal that performed adminLogin, and logout must invalidate the session so validateAdminSession returns false afterward.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "I am not able to access the admin panel"
        ]
      },
      "acceptanceCriteria": [
        "Calling adminLogin with valid credentials returns a non-empty session token.",
        "Calling validateAdminSession with that token returns true for the same caller principal after login.",
        "Calling adminLogout invalidates the session so validateAdminSession returns false afterward.",
        "Invalid credentials do not create a valid session and return a safe error (no sensitive data)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Ensure frontend admin session handling provides actionable, user-friendly English errors when adminLogin/validateAdminSession fail (e.g., invalid credentials, unauthorized, backend unavailable), and never exposes credentials in logs or error messages.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "I am not able to access the admin panel"
        ]
      },
      "acceptanceCriteria": [
        "If adminLogin fails, the modal shows a concise English error and remains usable for another attempt.",
        "If validateAdminSession fails due to an invalid/expired session, the stored token is cleared and the user is prompted to log in again (without leaving the admin UI in a broken state).",
        "No UI or console output contains the entered username/password."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional canisters/services).",
    "Do not modify files under frontend/src/components/ui or any frontend immutablePaths; compose existing UI components instead."
  ],
  "nonGoals": [
    "Adding new admin product features beyond restoring access (e.g., new dashboard modules).",
    "Introducing third-party auth providers; only existing mechanisms are in scope."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}