{
  "kind": "build_request",
  "title": "Switch Admin Panel authentication from Internet Identity to username/password only",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Remove the dependency on Internet Identity for Admin Panel access so that admin login and admin route protection are based only on username + password authentication.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The access to admin panel should only be username and password oriented and not with internet identity"
        ]
      },
      "acceptanceCriteria": [
        "Accessing /admin while logged out shows an admin login prompt (username + password) and does not trigger or require an Internet Identity login flow.",
        "After successful username/password login, the user is routed to /admin without using an Internet Identity identity.",
        "Admin logout ends the username/password session and returns the user to a logged-out admin state."
      ]
    },
    {
      "id": "REQ-18",
      "text": "Move admin credential verification to the backend and remove any hardcoded admin username/password checks from frontend source code.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The access to admin panel should only be username and password oriented and not with internet identity"
        ]
      },
      "acceptanceCriteria": [
        "No frontend file contains the literal admin password (\"innovation123publicschool\") or performs local string comparisons for admin authentication.",
        "The backend exposes a login method that accepts username and password and returns an authenticated admin session indicator (e.g., session token).",
        "Invalid credentials are rejected by the backend and the frontend displays a clear error message in English (e.g., \"Invalid credentials\")."
      ]
    },
    {
      "id": "REQ-19",
      "text": "Enforce admin authorization for all admin actions using the new username/password session mechanism (not Principal-based Internet Identity), including content section CRUD, gallery CRUD, enquiries management, and contact details updates.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The access to admin panel should only be username and password oriented and not with internet identity"
        ]
      },
      "acceptanceCriteria": [
        "All backend mutations and admin-only reads used by the Admin Dashboard reject requests that do not include a valid admin session (e.g., missing/invalid/expired token).",
        "Admin-only operations cannot be performed by anonymous callers without a valid admin session.",
        "Public endpoints (e.g., submitting enquiries, reading published/public content and contact details) remain accessible without requiring an admin session."
      ]
    },
    {
      "id": "REQ-20",
      "text": "Update the Admin Dashboard data layer to call the backend using the new admin session mechanism for admin-only queries/mutations, without modifying immutable frontend paths.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "The access to admin panel should only be username and password oriented and not with internet identity"
        ]
      },
      "acceptanceCriteria": [
        "Admin Dashboard screens (content manager, gallery manager, enquiries manager, contact details manager) continue to work after the authentication change.",
        "Admin-only React Query hooks use the admin session mechanism when calling admin-only backend methods.",
        "Implementation does not require edits to any immutable paths (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui/*.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Do not add third-party authentication providers (only custom username/password admin auth is required).",
    "Do not change the public website content structure, styling system, or page layouts except where required to support the new admin login flow.",
    "Do not implement multi-admin user management, password reset flows, or email/SMS verification unless explicitly requested later."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}