{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore reliable admin access with session-backed login + guard (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Ensure /admin reliably shows a login prompt when unauthenticated, transitions to the dashboard after adminLogin (even for anonymous actor), persists access for the browser session, and avoids infinite “Verifying admin access…” states with clear retryable errors.",
      "acceptanceCriteria": [
        "Navigating to /admin as a fresh visitor shows the Authentication Required screen (not an infinite loading state).",
        "Clicking Login opens the Admin Panel Login modal and allows a successful login flow that results in the admin dashboard being rendered.",
        "After a successful login, reloading the page at /admin keeps the admin dashboard accessible for the same browser session until logout (or until the session is invalidated).",
        "If the backend actor is temporarily unavailable, the UI shows a clear English error state (not a blank page/spinner) and still allows retrying login."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/adminSessionStore.ts",
          "operation": "create",
          "description": "Create a small shared admin-session token store (in-memory + sessionStorage) with subscribe/notify helpers so multiple useAdminSession callers stay synchronized (fixes login modal vs route-guard state mismatch). Persist token in sessionStorage (browser-session scope)."
        },
        {
          "path": "frontend/src/hooks/useAdminSession.ts",
          "operation": "modify",
          "description": "Refactor to use the shared adminSessionStore for token state (instead of per-hook local state) and switch persistence from localStorage to sessionStorage. Add explicit, user-safe validation error state and a retry/refresh validation action. Ensure validation failures never leave the UI stuck and never log or expose credentials. Use the authorization component guidance for anonymous/guest handling and auth error hygiene; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminAuth.ts",
          "operation": "modify",
          "description": "Update derived admin-auth state to avoid blocking /admin on actor initialization when no admin token exists (fresh visitor should immediately see the Authentication Required screen). Only enter “checking auth” when a token exists and validation is in progress; propagate validation error + retry action for the guard UI. Use the authorization component guidance around authenticated vs guest behavior; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "Adjust the guard UI logic to: (1) immediately render Authentication Required when no session token is present, (2) show a clear English error state when validation cannot be performed (e.g., backend unavailable) with a Retry button that re-runs validation and a Login button to open the modal, and (3) only show “Verifying admin access…” when a token exists and validation is actually in flight—preventing infinite loading. Use existing composed UI components only (do not modify frontend/src/components/ui)."
        },
        {
          "path": "frontend/src/components/admin/AdminLoginModal.tsx",
          "operation": "modify",
          "description": "Ensure the login modal uses the shared session-backed auth state so a successful login immediately unlocks the /admin guard (no stale hook instances). Keep errors concise and actionable via existing getErrorMessage patterns, and ensure password is cleared on both success/failure and never appears in logs/messages. Use the authorization component guidance for error handling and logout/cache clearing patterns; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Provide user-friendly English errors for adminLogin/validateAdminSession failures (invalid credentials, unauthorized, backend unavailable), clear invalid/expired tokens, and ensure no credentials are exposed in UI or console output.",
      "acceptanceCriteria": [
        "If adminLogin fails, the modal shows a concise English error and remains usable for another attempt.",
        "If validateAdminSession fails due to an invalid/expired session, the stored token is cleared and the user is prompted to log in again (without leaving the admin UI in a broken state).",
        "No UI or console output contains the entered username/password."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/errorMessage.ts",
          "operation": "modify",
          "description": "Harden and align error mapping for admin auth flows: clearly distinguish invalid credentials vs unauthorized vs backend unavailable/network, keep messages concise English, and avoid echoing raw trap/stack text. Ensure messages cannot include user-entered credentials by design."
        },
        {
          "path": "frontend/src/hooks/useAdminSession.ts",
          "operation": "modify",
          "description": "Ensure validate failures are handled explicitly: invalid/expired clears the session token; backend-unavailable retains token but exposes a user-friendly error for the guard with a retry action; never log raw error objects that might contain sensitive data. Use the authorization component error-handling guidance; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminLoginModal.tsx",
          "operation": "modify",
          "description": "Use sanitized errors only (from hook/util), keep the modal usable after failures, and ensure no console/UI output includes username/password. Confirm password-clearing happens immediately on submit completion paths and that no debug logging prints form values."
        },
        {
          "path": "frontend/src/components/admin/AdminRouteGuard.tsx",
          "operation": "modify",
          "description": "When session validation indicates invalid/expired, ensure the user is returned to the Authentication Required UI with an immediate path to re-login; when validation fails due to backend issues, render a clear retryable error state instead of a spinner/blank screen."
        }
      ]
    }
  ]
}